{"project1":{"did":[{"date":"11/16/23","description":"We should also be able to select one of our tasks that are premade and edit the item.\n only have the ability to change the title and the description","title":"create edit tasks"},{"date":"11/16/23","description":"We should also be able to delete one our tasks","title":"create delete tasks"},{"date":"11/16/23","description":"when we hover over a taks the footer should display a description of the task. \n this task should have name, date, description","title":"properly preview task and its description"},{"date":"11/16/23","description":"we should be able to move items to the left or to the right","title":"functionality to move items"},{"date":"11/16/23","description":"we need to be able to navigate through each column with VIM bindings of course","title":"enable navigation"},{"date":"12-12-2023","description":"I want to be able to add some sort of priority to the items that I have listed. Should be able to move items up and down a column by simply using Shift+K and Shift+J respectively","title":"add functionality to move items up/down"},{"date":"11/16/23","description":"Goban only has one place to store current todos/doings/dids. \n We want to be able to separate tasks based on the project that we are currently in. Should be able to navigate through projects with the UI adjusting accordingly","title":"support multi project functionality"},{"date":"11/16/23","description":"Now we have most of the navigation down.\n We need to be able to create a task and add it to this json \n should have a task name, task description, date created (which should be auto generated)\n Note we need to do some stuff with writing to json to persist!","title":"create add tasks"},{"date":"11/16/23","description":"goban layout should have a header, 3 columns, footer for descriptions","title":"create goban board layout"}],"doing":[{"date":"12-12-2023","description":"Want to turn Goban into a one-stop shop for productivity. we have a Kanban board but now I want to include a little pomodoro setup and move on from there. The goal is to live in this little TUI. Do everything here, live and die by the Goban","title":"tech debt: pomodoro"}],"todo":[{"date":"12-12-2023","description":"We should also be able to delete one our tasks","title":"feature: need to be able to archive past todos"},{"date":"12-12-2023","description":"as of now theres no way to see what project youre on. you can only tell by looking at the tasks, too much mental overhead","title":"tech debt: add a title for the project"},{"date":"12-12-2023","description":"Weird behavior that only seems to happen when we switch from project to project. Once you switch multiple times try to go to an item on the did section and move it to the left. idk how to explain it right now but its a bug. so it looks like you cannot move the top item of a list to the left. ill have to look into it","title":"bug: cant shift items to left"},{"date":"12-12-2023","description":"set a dynamic ending for titles and descriptions","title":"tech debt: make UI pretty please"},{"date":"12-12-2023","description":"theres a lot of code reuse in jsoner.go and is sorta ugly, i want to fix it","title":"tech debt: refactor jsoner.go"},{"date":"12-12-2023","description":"theres a lot of messy code and ugly if statements in column.go lets make it somewhat understandable","title":"tech debt: refactor column.go"},{"date":"12-12-2023","description":"as of now we can only run this on windows 10 using the command prompt. its weird on windows git bash (can only run it in IntelliJ gitbash) and it does not render prettily on my Arch Linux box","title":"tech debt: support different os and terminals"}]}}